//ОСНОВНОЙ КОД ЗАПОЛНЕНИЯ ШАБЛОНА В СЛЕДУЮЩИХ ОБНОВАХ!
const CFG_templates = {
    description: 'Пользовательская настройка',
    // ============================================================
    // КАТЕГОРИИ САЙТОВ
    // ============================================================
    categories: {
        ru1: {
            name: '',
            sites: [],
            shortName: 'ru1',
            description: '',
            shortDomains: []
        },
        ru2: {
            name: '',
            sites: [],
            shortName: 'ru2',
            description: '',
            shortDomains: []
        },
        en1: {
            name: '',
            sites: [],
            shortName: 'en1',
            description: '',
            shortDomains: []
        },
        en2: {
            name: '',
            sites: [
            ],
            shortName: 'en2',
            description: '',
            shortDomains: []
        }
    },

    // ============================================================
    // ТЕСТ СКОРОСТИ
    // ============================================================
    speedTest: {
        download: "",
        upload: "",
        uploadSize: 1 * 1024 * 1024,
        attempts: '',
        timeout: ''
    },

    // ============================================================
    // ТЕСТ ПИНГА
    // ============================================================
    ping: {
        url: "",
        attempts: "",
        timeout: ""
    },
    // ============================================================
    // ПРОВЕРКА ПРОТОКОЛОВ
    // ============================================================
    protocols: {
        dns: {
            url: "",
            domain: "",
            timeout: ""
        },
        http: {
            url: "",
            timeout: ""
        },
        https: {
            urls: [
                ""
            ],
            timeout: ""
        }
    }
};
const CFG_user = ''